let count = localStorage.getItem("count")
  ? parseInt(localStorage.getItem("count"))
  : 0;
const data = [
  {
    code: 2308,
    clue: "<h3>புதையல் வேட்டைக்கு வருக. </h3> <h4>தரப்படும் அறிவுறுத்தல்களை நன்கு கிரகித்து இறுதியில் தரும் கடவுச்சொல்லை உள்ளிடுவதன் மூலம் முதலாவது தடயத்தை பெறலாம்.</h4> <h4>வெற்றி பெற வாழ்த்துக்கள்!</h4>",
  },
  {
    code: 741837707,
    clue: "வீதியில் ஓர் விளக்கிருக்கும் <br/> விளக்கருகே ஓர் வீடிருக்கும் <br/> காப்பீடாய் ஒரு பலகை உண்டு <br/> அதனருகே இந்த அறிக்கை உண்டு <br/> அதில் அருள் சேர் முருகன் நகையுமுண்டு <br/> அதன் அழைப்பிலக்கமாய் அடுத்த தடயம் உண்டு",
  },
  {
    code: 125,
    clue: "நலிந்தார் செல்லும் இடம் சார் அமைச்சு <br/> அதன் எதிர் இருக்கும் இளம் சிவப்பு மனை <br/> நீலப்படலையில் கடவுச்சொல் தேடு.",
  },
  {
    code: 19,
    clue: "நமசிவாய எனும் நாமம் தினமொலிக்கும் <br/> கைலைநாதன் சந்நிதி இது <br/> அம்மன் பதம் வைக்கும் அரிமாவின் காலடியில் கனவுருக் கற்குவியல்<br/> கல்லெண்ணிக்கையில் அடுத்த தடயம்.",
  },
  {
    code: 1903,
    clue: "63 நாயன்மாரில் இவர் ஒருவர் <br/> நின்ற சீர்நெடுமாறனின் துணைவி இவர் <br/> இவர் பெயரில் இப்பள்ளி இங்குண்டு <br/> இது ஆரம்பித்த ஆண்டில் அடுத்த தடயமுண்டு",
  },
  {
    code: 27,
    clue: "செல்வத்தின் அதிபதி வாயில் இது <br/> கரு மீசை கொண்ட விஸ்வக்ஷேனர் காக்கும் திசை இது <br/> இதை அலங்கரிக்க மூன்றடுக்கில் மின்குமிழ் உண்டு  <br/> முன்னிருந்து பார்க்கையில் அதன் எண்ணிக்கையில் அடுத்த தடயம் உண்டு",
  },
  {
    code: 356,
    clue: "வேடன் போல் வேடமிட்டு <br/> முருகன் மணந்த குறத்தி இவள் <br/> இவள் மனை அருகே நீர் எடுக்கும் மூடிய குழி உண்டு <br/> அதன்கண் உள்ள கம்பத்தில் காணும் எண்.",
  },
  {
    code: 5014,
    clue: "சைவ அடியார்கள் சார்ந்த ஓர் இடம் <br/> அம்பலவாணர் நிறுவிய மடம் <br/> கிறிஸ்துக்கு பின் தோன்றியது <br/> அதன் கலியுக வருடத்தில் அடுத்த தடயம்",
  },
  {
    code: 100,
    clue: "Yarl IT Hub சார்ந்த ஒரு புதிர். <br/> பல தொழில்சார் முனைவர்களை உருவாக்கும் Yarl IT Hub ஆனது 2022 ஆம் ஆண்டின் இறுதியில் குறித்த எண்ணிக்கையான புதிய தொழில் நிறுவனங்களை உருவாக்குவதை ஊக்குவிப்பதை இலக்காக கொண்டுள்ளது <br/> அந்த எண்ணிக்கை அடுத்த தடயத்திற்கு கூட்டிச் செல்லும் <br/> (Yarl IT Hub இணையம்)",
  },
  {
    code: 1927,
    clue: "1936ம் ஆண்டில் உருவான திறைசேரி <br/> முன்னே சமிக்ஞை கம்பமருகே உள்ளதோர் பணிமனை. <br/> பதாதையில் உளவளத்துணை சார் அழைப்பு எண்.",
  },
  {
    code: 800,
    clue: "தொன்மைக்கால மாந்தர் தம் செயற்பாடு <br/> அதை பகுப்பாய்வு செய்யும் புலம் சார்ந்தது <br/> அதற்கு வழி சொல் வழிகாட்டி இருக்கின்றது  <br/> அதன் தூரத்தில் அடுத்த தடயம் உண்டு",
  },
  {
    code: 7,
    clue: "ஒவ்வோர் இரவும் உட்சென்று <br/> மறுநாள் சேற்றில் மலர்வது இங்குண்டு <br/> ஈட்டி ஏந்திநிற்பவன் எண்ணிக்கை <br/> வழிகாட்டும் புதையலுக்கான எண்ணை",
  },
  {
    code: 111,
    clue: "<h3>வாழ்த்துக்கள்!</h3> <br/> இந்தப் புதையல் வேட்டையில் நீங்கள் வெற்றி வெற்றி பெற்றுவிட்டீர்கள். <br/> கீழ் காணும் இரகசிய சொல்லை Yarl IT Hub திரு விழாக்காலக் காட்சியறையில் சமர்ப்பிக்கவும். முதலாவதாக சமர்ப்பிக்கும் அணி புதையலை வெல்லும். <br/> <strong> இரகசிய சொல்: சுடர் </strong> ",
  },
];

if (count == 12) {
  document.getElementById("input-area").innerHTML = "";
}

document.getElementById("output").innerHTML = data[count].clue;

function checkCode() {
  const enteredCode = document.getElementById("code").value;
  if (enteredCode == data[count].code) {
    document.getElementById("message").style.display = "none";
    localStorage.setItem("count", count + 1);
    location.reload();
  } else {
    document.getElementById("message").style.display = "block";
  }
}
